## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/195293)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.apollo
  * null_resource.apollo_update-task-definition



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.apollo must be replaced
+/- resource "aws_ecs_task_definition" "apollo" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:512" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - mountPoints            = []
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - cpu                    = 0
                  ~ environment            = [
                        # (1 unchanged element hidden)
                        {
                            name  = "AWS_SQS_ENDPOINT"
                            value = "https://sqs.us-east-1.amazonaws.com"
                        },
                      + {
                          + name  = "CORPUS_INDEX_DE"
                          + value = "corpus_de"
                        },
                      + {
                          + name  = "CORPUS_INDEX_EN"
                          + value = "corpus_en"
                        },
                      + {
                          + name  = "CORPUS_INDEX_ES"
                          + value = "corpus_es"
                        },
                      + {
                          + name  = "CORPUS_INDEX_FR"
                          + value = "corpus_fr"
                        },
                      + {
                          + name  = "CORPUS_INDEX_IT"
                          + value = "corpus_it"
                        },
                        {
                            name  = "ELASTICSEARCH_DOMAIN"
                            value = "userlistsearch-prod-v2"
                        },
                        # (6 unchanged elements hidden)
                    ]
                  - mountPoints            = []
                    name                   = "node"
                  - systemControls         = []
                  - volumesFrom            = []
                    # (6 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "UserListSearch-Prod-Apollo" -> (known after apply)
      ~ revision                 = 512 -> (known after apply)
        tags                     = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "UserListSearch"
        }
        # (12 unchanged attributes hidden)
    }

  # null_resource.apollo_update-task-definition must be replaced
-/+ resource "null_resource" "apollo_update-task-definition" {
      ~ id       = "7622972108244371609" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "task_arn" = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:512" -> (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:512" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"840c2b31-c8dd-41c5-a284-56fbad9bcbff","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":567,"Program":"tfcmt","SHA1":"427b95412fb8a6c65867d2670e73b954a9a3dd35","Target":"user-list-search-cdk","Vars":{}} -->